excel_demo/app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    require 'csv'
    @products = Product.all

INSERT INTO "products" ("name", "price", "released_on", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Book"], ["price", 100], ["released_on", "2015-10-20 12:36:00.000000"], ["created_at", "2015-10-20 12:36:49.333379"], ["updated_at", "2015-10-20 12:36:49.333379"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save