excel_demo/app/views/products/index.json.jbuilder

SELECT "products".* FROM "products"
---
json.array!(Product.all) do |product|