carrierwave/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "sex", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "aaa"], ["sex", "dd"], ["picture", "2150765.png"], ["created_at", "2015-10-30 23:31:20.611998"], ["updated_at", "2015-10-30 23:31:20.611998"]]

  def update
    render :text => params #user_params
    return
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "picture" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["picture", "2150758.png"], ["updated_at", "2015-10-30 23:21:00.469089"], ["id", 1]]